{
  "backend/main.mo": "Motoko canister defining product types, static product list, and query methods for listing, filtering, searching, and fetching products by ID.",
  "feature_evidence.json": "Feature evidence metadata mapping features to affected frontend files with IDs, components, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files in the project.",
  "frontend/index.css": "Global Tailwind-based OKLCH theme variables for light/dark modes and base styling.",
  "frontend/index.html": "Root HTML document setting the page title to Luxury Bazar and loading the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the application in the CartProvider.",
  "frontend/src/cart/CartContext.tsx": "React context and reducer managing cart items, quantity updates, removal, and subtotal calculation.",
  "frontend/src/cart/cartTypes.ts": "Type definitions for cart items, state, and reducer actions.",
  "frontend/src/cart/useCart.ts": "Custom hook providing access to the cart context with safety checks.",
  "frontend/src/components/catalog/CategoryHero.tsx": "Category hero banner component showing a themed image, title, and description for a given category.",
  "frontend/src/components/catalog/ProductCard.tsx": "Product card showing image, title, price, and add‑to‑cart action linking to the product page.",
  "frontend/src/components/catalog/ProductGrid.tsx": "Responsive grid layout wrapper for product cards.",
  "frontend/src/components/catalog/ProductMeta.tsx": "Displays product category badge, formatted price, and optional description.",
  "frontend/src/components/common/StoreSection.tsx": "Reusable page section wrapper with optional title and description.",
  "frontend/src/components/feedback/ErrorState.tsx": "Error display component with message and optional retry button.",
  "frontend/src/components/feedback/LoadingState.tsx": "Skeleton‑based loading component with optional message.",
  "frontend/src/components/home/SectionLinkCard.tsx": "UI card linking to category pages, extracting category from href and showing image, title, and description.",
  "frontend/src/components/layout/StoreFooter.tsx": "Store footer with navigation links, social icons, and dynamic year plus referral link.",
  "frontend/src/components/layout/StoreLayout.tsx": "Wraps header, footer, and routed content into a full-page layout.",
  "frontend/src/components/nav/StoreHeader.tsx": "Header with nav links, store logo, and cart item count, supporting mobile navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, logout, stored identity, and AuthClient setup.",
  "frontend/src/index.css": "Re-exports root CSS from parent directory.",
  "frontend/src/main.tsx": "App entrypoint initializing React, query client, and Internet Identity provider.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with quantity controls, pricing, and empty-cart fallback.",
  "frontend/src/pages/CategoryPage.tsx": "Loads products for a category and shows hero, product grid, and loading/error states.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard summarizing product counts and per-category metrics with loading and error handling.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with a hero banner, category sections, and featured products fetched via React Query. Handles loading and error states while displaying product previews.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed information for a selected product, including image, metadata, and add‑to‑cart functionality. Handles product loading, errors, and navigation back.",
  "frontend/src/services/catalogQueries.ts": "Defines React Query hooks for listing, filtering, searching, and retrieving products using the actor-based backend API. Includes enabling rules and error handling for missing actors.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, animations, and container settings for the storefront theme. Enables plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the project’s current state, features, requirements, and architectural notes for building the ‘Luxury Bazar’ storefront. No code logic, only metadata and planning info."
}